Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Constructor (Identifier)
 Instantiates a hierarchical definition with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicDefinition(
	Identifier ID
)
Public Sub New (
	ID As Identifier
)
Parameters
ID
Type: Tekla.Structures.Identifier
The identifier of an existing hierarchical definition.
Examples
using Tekla.Structures.Model;
using Tekla.Structures;
public class Example
{
       public void Example1()
       {
           Identifier id = new Identifier(357);
           HierarchicDefinition hierarchicalDefinition = new HierarchicDefinition(id);
       }
}
See Also
Reference
HierarchicDefinition Class
HierarchicDefinition Overload
Tekla.Structures.Model Namespace